/*
Задание №1. Консольный чат.

Необходимый функционал:

   Два типа пользователей: “клиент” и “агент”, которые могут общаться друг с другом.
   Поддерживаются только личные сообщения клиента с агентом (клиент не может писать другому клиенту, а агент - другому агенту).
   Когда клиент начинает писать сообщение, он ещё не знает, с каким агентом он будет общаться.

   При получении первого сообщения клиента сервер должен выбрать свободного агента в качестве собеседника.

   Агент может вести беседу одновременно только с одним клиентом.
   Должны поддерживаться консольные команды для регистрации в системе, завершения чата и выходы из системы.
   Сообщения, отправленные клиентом в отсутствии соединения с агентом не должны теряться.


Технические требования:

   Автоматическая сборка проекта посредством Apache Maven
   Покрытие кода unit-тестами
   Логирование основных событий с указанием времени:
       Появления агента и клиента в системе
       Начало и завершение чата


Пример варианта использования:

   Запускаем сервер
   Запускаем клиентское приложение
   Вводим “/register agent Cooper”
   Сервер регистрирует нас как агента
   Запускаем ещё один экземпляр клиентского приложения
   Вводим “/register client Alice”
   Сервер регистрирует нового клиента
   Клиент вводит “Hello, I need help”
   Агент получает сообщение и может ему ответить “How can I help you?”
   Клиент может продолжить переписку или завершить чат: “/leave”
   После завершения чата клиент может снова написать сообщение и, возможно, попасть на другого агента
   Клиент или агент может выйти из системы, введя “/exit”, в этом случае приложение закрывается.
 */

public interface TCPConnectionListener {
    void connectionReady(TCPConnection connection, String reg);
    void receiveMessage(TCPConnection connection, String msg);
    void disConnect(TCPConnection connection);
    void occurException(TCPConnection connection, Exception e);
}
